Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: the output type of the key mapping function
ja: キーに写像する関数の出力型

source: the output type of the value mapping function
ja: 値に写像する関数の出力型

source: the result of the reduction
ja: 簡約の結果

source: the result stream
ja: 結果のストリーム

source: the result type of the downstream reduction
ja: 下流の簡約の結果型

source: the result type of the reduction operation
ja: 簡約処理の結果型

source: the second stream
ja: 2つ目のストリーム

source: the sequence of characters to be used at the beginning of the joined result
ja: 連結した結果の先頭に使われる文字の列

source: the sequence of characters to be used at the end of the joined result
ja: 連結した結果の末尾に使われる文字の列

source: the single element
ja: 1つの要素

source: the sum of elements in this stream
ja: このストリームの要素の和

source: the type of input elements to the reduction operation
ja: 簡約処理の入力要素の型

source: the type of of the stream implementing {@code BaseStream}
ja: {@code BaseStream}を実装したストリームの型

source: the type of stream elements
ja: ストリーム要素の型

source: the type of the input elements
ja: 入力要素の型

source: the type of the keys
ja: キーの型

source: the type of the mapped values
ja: 写像後の値の型

source: the type of the result
ja: 結果の型

source: the type of the resulting {@code Collection}
ja: 結果の{@code Collection}の型

source: the type of the resulting {@code ConcurrentMap}
ja: 結果の{@code ConcurrentMap}の型

source: the type of the resulting {@code Map}
ja: 結果の{@code Map}の型

source: the type of the stream elements
ja: ストリーム要素の型

source: the {@code Collector} describing the reduction
ja: 簡約を表現する{@code Collector}

source: the {@code DoubleSupplier} for generated elements
ja: 生成される要素の{@code DoubleSupplier}

source: the {@code IntSupplier} for generated elements
ja: 生成される要素の{@code IntSupplier}

source: the {@code LongSupplier} for generated elements
ja: 生成される要素の{@code LongSupplier}

source: the {@code Supplier} of generated elements
ja: 生成される要素の{@code Supplier}

source: though the explicit map-reduce form is more readable and therefore should usually be preferred.
ja: ただし明示的な写像・簡約(map-reduce)構成(訳註: {@code map}メソッドと{@code reduce}メソッドに分けて書く形式)の方がより読みやすく、したがって通常はそちらの方が好ましい。

source: type of elements
ja: 要素の型

source: type of elements accepted by downstream collector
ja: 下流のコレクタによって受理される要素の型

source: type of the result
ja: 結果の型

source: {@code this} builder
ja: ビルダである{@code this}

source: {@code true} if any elements of the stream match the provided predicate, otherwise {@code false}
ja: このストリームのある要素が与えられた述語に適合するならば{@code true}でそうでなければ{@code false}

source: {@code true} if either all elements of the stream match the provided predicate or the stream is empty, otherwise {@code false}
ja: このストリームの全ての要素が与えられた述語に適合するならば{@code true}でそうでなければ{@code false}

source: {@code true} if either no elements of the stream match the provided predicate or the stream is empty, otherwise {@code false}
ja: このストリームのど要素も与えられた述語に適合しないならば{@code true}でそうでなければ{@code false}

source: {@code true} if this stream would execute in parallel if executed
ja: もしこのストリームが実行された場合に並列に実行されるならば{@code true}
